const data = [
    {
        q: "JVM",
        a: "- Виртуальная машина Java для исполнения байт-кода.\n- Загрузка, проверка, выделение памяти, инициализация, интерпретация/компиляция, управление памятью и потоками."
    },
    {
        q: "Интерфейсы vs абстрактные классы",
        a: " - Интерфейсы: только абстрактные методы, множественное наследование, нет состояния.\n- Абстрактные классы: абстрактные и конкретные методы, одиночное наследование, могут содержать состояние."
    }
]

export default data;